#pragma once
#include "stdafx.h"

struct CStaticPickupsInfo
{
	char _0x00[0x18];
	int m_RegenTime; //0x18
	char _0x1C[0x29];
	struct
	{
		bool m_PickupState : 1;
		bool m_PendingPickup : 1;
		uint8_t _0x45 : 6;
	};
	char _0x46[0x0A];
};

struct CDynamicPickupsInfo
{
	char _0x00[8];
	int m_Value; //8
	int _0x0C;
	uint32_t m_RoomHashKey; //0x10
	char _0x14[8];
	vector3 m_Position; //0x1C
	char _0x28[0x18];
	short m_ModelIndex; //0x40
	short m_ReferenceIndex; //0x42
	uint8_t m_Type; //0x44
	struct
	{
		uint8_t _0x45_1 : 6;
		bool m_LightEffect : 1;
		bool _0x45_2 : 1;
	};
	struct
	{
		uint8_t _0x46_1 : 2;
		bool m_Blipped : 1;
		uint8_t _0x46_2 : 5;
	};
	char _0x47[9];
};

struct CPedGroup //0x5C [47]
{
	char _0x00[8];
	char m_Members[0x44];
	float m_Seperation; //0x4C
	int _0x50;
	uint32_t m_Owner; //0x54
	int _0x58;
};

enum eWeaponType : int
{
	WEAPON_UNARMED,
	WEAPON_BASEBALLBAT,
	WEAPON_POOLCUE,
	WEAPON_KNIFE,
	WEAPON_GRENADE,
	WEAPON_MOLOTOV,
	WEAPON_ROCKET,
	WEAPON_PISTOL,
	WEAPON_UNUSED0,
	WEAPON_DEAGLE,
	WEAPON_SHOTGUN,
	WEAPON_BARETTA,
	WEAPON_MICRO_UZI,
	WEAPON_MP5,
	WEAPON_AK47,
	WEAPON_M4,
	WEAPON_SNIPERRIFLE,
	WEAPON_M40A1,
	WEAPON_RLAUNCHER,
	WEAPON_FTHROWER,
	WEAPON_MINIGUN,
	WEAPON_EPISODIC_1,//Grenade Launcher TLAD/TBOGT
	WEAPON_EPISODIC_2,//Sweeper Shotgun TLAD
	WEAPON_EPISODIC_3,
	WEAPON_EPISODIC_4,//POOL CUE TLAD
	WEAPON_EPISODIC_5,//Grenade From the Grenade Launcher TLAD/TBOGT
	WEAPON_EPISODIC_6,//Sawnoff Shotgun TLAD
	WEAPON_EPISODIC_7,//Automatic 9mm TLAD
	WEAPON_EPISODIC_8,//Pipe Bomb TLAD
	WEAPON_EPISODIC_9,//.44 Pistol TBOGT
	WEAPON_EPISODIC_10,//Explosive AA12 TBOGT
	WEAPON_EPISODIC_11,//AA12 TBOGT
	WEAPON_EPISODIC_12,//P-90 TBOGT
	WEAPON_EPISODIC_13,//Golden Uzi TBOGT
	WEAPON_EPISODIC_14,//M249 TBOGT
	WEAPON_EPISODIC_15,//Explosive Sniper TBOGT
	WEAPON_EPISODIC_16,//Sticky Bombs TBOGT
	WEAPON_EPISODIC_17,//BUZZARD (heli) rocket launcher/null TBOGT
	WEAPON_EPISODIC_18,//BUZZARD (heli) rocket for BUZZARD rocket launcher/freeze TBOGT
	WEAPON_EPISODIC_19,//BUZZARD (heli) minigun TBOGT
	WEAPON_EPISODIC_20,//APC cannon TBOGT
	WEAPON_EPISODIC_21,//Parachute TBOGT
	WEAPON_EPISODIC_22,
	WEAPON_EPISODIC_23,
	WEAPON_EPISODIC_24,
	WEAPON_CAMERA,
	WEAPON_OBJECT,
	WEAPON_WEAPONTYPE_LAST_WEAPONTYPE,
	WEAPON_ARMOUR,
	WEAPON_RAMMEDBYCAR,
	WEAPON_RUNOVERBYCAR,
	WEAPON_EXPLOSION,
	WEAPON_UZI_DRIVEBY,
	WEAPON_DROWNING,
	WEAPON_FALL,
	WEAPON_UNIDENTIFIED,
	WEAPON_ANYMELEE,
	WEAPON_ANYWEAPON,
};

enum eWeaponFlag
{
	CAN_AIM,
	CAN_AIM_WITH_ARM,
	CAN_FREE_AIM,
	FIRST_PERSON,
	KEEP_CAMERA_BEHIND,
	GUN,
	THROWN,
	HEAVY,
	SILENCED,
	MELEE_CLUB,
	MELEE_BLADE,
	ARMOUR_PENETRATING,
	TWO_HANDED,
	TREAT_AS_2HANDED_IN_COVER,
	ANIM_RELOAD,
	ANIM_CROUCH_FIRE,
	CREATE_VISIBLE_ORDANCE,
	EXPLOSION_BASED_ON_IMPACT,
	ADD_SMOKE_ON_EXPLOSION,
	INSTANT_KILL_IN_MP,
	HIGHER_BREAK_FORCE
};

class CWeaponInfo
{
public:
	char _0x00[0x20];
	uint32_t m_AimFlags; //0x20
	int _0x24;
	int m_AnimationIndex; //0x28

	static CWeaponInfo* GetWeaponInfo(eWeaponType weapon) { return ((CWeaponInfo*(*)(eWeaponType))0x82299AD0)(weapon); }
};

struct CWeapon
{
	char _0x00[0x14];
	eWeaponType m_WeaponIndex;
};

class CAnimAssociations
{
	int _0x00;

public:
	static CAnimAssociations* GetInstance() { return *reinterpret_cast<CAnimAssociations**>(0x82BF9AA4); }
	int GetGroupId(const char* animation) { return ((int(*)(CAnimAssociations*, const char*))0x82248CF0)(this, animation); }
};

class CPedWeaponMgr
{
public:
	int _0x00;

	CWeapon* GetWeaponUsable()
	{
		return ((CWeapon*(*)(CPedWeaponMgr*))0x823D4D60)(this);
	}
};

enum eNetworkObjectType : int
{
	NET_OBJ_TYPE_PLAYER,
	NET_OBJ_TYPE_PED,
	NET_OBJ_TYPE_DUMMY_PED,
	NET_OBJ_TYPE_AUTOMOBILE,
	NET_OBJ_TYPE_OBJECT,
	NET_OBJ_TYPE_BIKE,
	NET_OBJ_TYPE_TRAIN,
	NET_OBJ_TYPE_BOAT,
	NET_OBJ_TYPE_HELI,
	NET_OBJ_TYPE_PLANE,
	NET_OBJ_TYPE_COUNT
};

class CNetworkObject;
class CEntity //0x70
{
public:
	char _0x04[0x1C];
	uint32_t m_OffsetPtr; //0x20
	char _0x24[0x44];
	CNetworkObject* m_NetObject; //0x68
	int _0x6C;

	virtual void call_00();
	virtual void call_04();
	virtual void call_08();
	virtual void call_0C();
	virtual void call_10();
	virtual void call_14();
	virtual void call_18();
	virtual void call_1C();
	virtual void call_20();
	virtual void call_24();
	virtual void call_28();
	virtual void call_2C();
	virtual void call_30();
	virtual void call_34();
	virtual void call_38();
	virtual void call_3C();
	virtual void call_40();
	virtual void call_44();
	virtual void call_48();
	virtual void call_4C();
	virtual void call_50();
	virtual void call_54();
	virtual void call_58();
	virtual void call_5C();
	virtual void call_60();
	virtual void call_64();
	virtual void call_68();
	virtual void call_6C();
	virtual void call_70();
	virtual void call_74();
	virtual void call_78();
	virtual void call_7C();
	virtual void call_80();
	virtual void call_84();
	virtual void call_88();
	virtual void call_8C();
	virtual void call_90();
	virtual void call_94();
	virtual void call_98();
	virtual void call_9C();
	virtual void call_A0();
	virtual void call_A4();
	virtual void call_A8();
	virtual void call_AC();
	virtual void call_B0();
	virtual void call_B4();
	virtual void call_B8();
	virtual void call_BC();
	virtual void call_C0();
	virtual void call_C4();

	float* GetPosition()
	{
		return reinterpret_cast<float*>(m_OffsetPtr + 0x20);
	}

	CNetworkObject* GetNetworkObject()
	{
		return m_NetObject;
	}

}; static_assert(sizeof(CEntity) == 0x70, "Incorrect sizeof CEntity");

class CDynamicEntity : public CEntity
{
public:
	char _0x70[0xA0];

	virtual void call_C8();
	virtual void call_CC();
	virtual void call_D0();
	virtual void call_D4();

}; static_assert(sizeof(CDynamicEntity) == 0x110, "Incorrect sizeof CDynamicEntity");

class CPhysical : public CDynamicEntity
{
public:
	char _0x110[0x100];

	virtual void call_D8();
	virtual void call_DC();
	virtual void call_E0();
	virtual void call_E4();
	virtual void call_E8();
	virtual void call_EC();
	virtual void call_F0();
	virtual void call_F4();
	virtual void call_F8();
	virtual void call_FC();
	virtual void call_100();
	virtual void call_104();
	virtual void call_108();

}; static_assert(sizeof(CPhysical) == 0x210, "Incorrect sizeof CPhysical");

class CPlayerInfo;
class CPed : public CPhysical
{
public:
	char _0x210[0x10];
	CPlayerInfo* m_PlayerInfo; //0x220
	char _0x224[0x5C];
	CPedWeaponMgr m_Inventory; //0x280
	char _0x284[0x7FC];
	CEntity* m_Vehicle; //0xA80
	char _0xA84[0x314];

	virtual void call_10C();
	virtual void call_110();
	virtual BOOL IsPlayer();

	CPedWeaponMgr* GetInventory()
	{
		return &m_Inventory;
	}

	CPlayerInfo* GetPlayerInfo()
	{
		return m_PlayerInfo;
	}

}; static_assert(sizeof(CPed) == 0xD98, "Incorrect sizeof CPed");

class CPlayerPed : public CPed
{
public:
	int _0xD98;

}; static_assert(sizeof(CPlayerPed) == 0xD9C, "Incorrect sizeof CPlayerPed");

class CVehicle : public CPhysical
{
public:
	char _0x210[0x10D0];

}; static_assert(sizeof(CVehicle) == 0x12E0, "Incorrect sizeof CVehicle");

class CAutomobile : public CVehicle
{
public:
	char _0x12E0[0xCC0];

}; static_assert(sizeof(CAutomobile) == 0x1FA0, "Incorrect sizeof CAutomobile");

class CHeli : public CAutomobile
{
public:
	char _0x1FA0[0x4A];
	signed char m_OwnerPlayer; //0x1FEA
};

enum SyncType : int
{
	SYNC_READ,
	SYNC_SKIP,
	SYNC_PEEK,
	SYNC_WRITE,
	SYNC_LOG,
	SYNC_SIZE
};

struct datBitBuffer
{
	union
	{
		uint8_t* m_ReadBits;
		uint8_t* m_WriteBits;
	};
	int m_BaseBitOffset;
	int m_MaxBits;
	int m_CursorPos;
	int m_NumBitsWritten;
	int m_NumBitsRead;
	struct
	{
		bool m_IsReadOnly : 1;
		bool m_IsNullWrite : 1;
		uint8_t _0x00 : 6;
	};

	void initialize(uint8_t* buffer, int bytes, bool read_only = false)
	{
		m_BaseBitOffset = 0;
		m_MaxBits = bytes << 3;
		m_CursorPos = 0;
		m_NumBitsRead = 0;
		m_NumBitsWritten = 0;
		m_WriteBits = buffer;
		m_IsReadOnly = read_only;
	}

	void Clear()
	{
		m_ReadBits = nullptr;
		m_BaseBitOffset = 0;
		m_MaxBits = 0;
		m_CursorPos = 0;
		m_NumBitsWritten = 0;
		m_NumBitsRead = 0;
		m_IsReadOnly = false;
	}

	void CopyBits(uint8_t* dst, uint8_t* src, int bits, int dst_offset, int src_offset)
	{
		((void(*)(uint8_t*, uint8_t*, int, int, int))0x828531F0)(dst, src, bits, dst_offset, src_offset);
	}

	void ReadUnsigned(uint32_t* u, int bits, int bit_offset)
	{
		((void(*)(uint8_t*, uint32_t*, int, int))0x828530D8)(m_ReadBits, u, bits, bit_offset);
	}

	template<typename T>
	T PeekUnsigned(int bits, int bit_offset)
	{
		T u = NULL;
		ReadUnsigned(reinterpret_cast<uint32_t*>(&u), bits, bit_offset);
		return u;
	}

	uint64_t PeekUns64(int bits, int bit_offset)
	{
		if (bits <= 32)
			return static_cast<uint64_t>(PeekUnsigned<uint32_t>(bits, bit_offset));

		uint32_t lower = PeekUnsigned<uint32_t>(32, bit_offset);
		uint32_t upper = PeekUnsigned<uint32_t>(bits - 32, bit_offset + 32);
		return (static_cast<uint64_t>(upper) << 32) | lower;
	}

	void PeekBits(uint8_t* buffer, int bits, int bit_offset)
	{
		CopyBits(buffer, m_ReadBits, bits, 0, bit_offset);
	}

	void PeekBytes(uint8_t* buffer, int bytes, int bit_offset)
	{
		PeekBits(buffer, bytes << 3, bit_offset);
	}

	void WriteUnsigned(uint32_t u, int bits, int bit_offset)
	{
		((void(*)(uint8_t*, uint32_t, int, int))0x82853158)(m_WriteBits, u, bits, bit_offset);
	}

	template<typename T>
	void PokeUnsigned(T u, int bits, int bit_offset)
	{
		WriteUnsigned(u, bits, bit_offset);
	}

	void PokeUns64(uint64_t u, int bits, int bit_offset)
	{
		if (bits <= 32)
			PokeUnsigned<uint32_t>(static_cast<uint32_t>(u), bits, bit_offset);
		else
		{
			PokeUnsigned<uint32_t>(static_cast<uint32_t>(u & 0xFFFFFFFF), 32, bit_offset);
			PokeUnsigned<uint32_t>(static_cast<uint32_t>(u >> 32), bits - 32, bit_offset + 32);
		}
	}

	void PokeBits(uint8_t* buffer, int bits, int bit_offset)
	{
		CopyBits(m_WriteBits, buffer, bits, bit_offset, 0);
	}

	void PokeBytes(uint8_t* buffer, int bytes, int bit_offset)
	{
		PokeBits(buffer, bytes << 3, bit_offset);
	}

	bool ReadUns32(uint32_t* u, int bits)
	{
		return ((bool(*)(datBitBuffer*, uint32_t*, int))0x822118C8)(this, u, bits);
	}

	bool ReadUns8(uint8_t* u, int bits)
	{
		return ((bool(*)(datBitBuffer*, uint8_t*, int))0x822119B8)(this, u, bits);
	}

	bool ReadUns16(uint16_t* u, int bits)
	{
		return ((bool(*)(datBitBuffer*, uint16_t*, int))0x826D9AC0)(this, u, bits);
	}

	bool ReadUns64(uint64_t* u, int bits)
	{
		return ((bool(*)(datBitBuffer*, uint64_t* u, int))0x82853930)(this, u, bits);
	}

	bool ReadBits(uint8_t* buffer, int bits, int seekBits)
	{
		return ((bool(*)(datBitBuffer*, uint8_t*, int, int))0x828536D8)(this, buffer, bits, seekBits);
	}

	bool ReadBytes(uint8_t* buffer, int bytes)
	{
		return ReadBits(buffer, bytes << 3, 0);
	}

	bool ReadStr(char* str, int maxChars)
	{
		return  ((bool(*)(datBitBuffer*, char*, int))0x82853C58)(this, str, maxChars);
	}

	bool WriteUns32(uint32_t u, int bits)
	{
		return ((bool(*)(datBitBuffer*, uint32_t, int))0x826D9BB0)(this, u, bits);
	}

	bool WriteUns8(uint8_t u, int bits)
	{
		return ((bool(*)(datBitBuffer*, uint8_t, int))0x82211948)(this, u, bits);
	}

	bool WriteUns16(uint16_t u, int bits)
	{
		return ((bool(*)(datBitBuffer*, uint16_t, int))0x826D9B40)(this, u, bits);
	}

	bool WriteUns64(uint64_t u, int bits)
	{
		return ((bool(*)(datBitBuffer*, uint64_t, int))0x828539D8)(this, u, bits);
	}

	bool WriteBits(uint8_t* buffer, int bits, int seekBits)
	{
		return ((bool(*)(datBitBuffer*, uint8_t*, int, int))0x82853868)(this, buffer, bits, seekBits);
	}

	bool WriteBytes(uint8_t* buffer, int bytes)
	{
		return ReadBits(buffer, bytes << 3, 0);
	}

	bool WriteStr(char* str, int maxChars)
	{
		return  ((bool(*)(datBitBuffer*, char*, int))0x82853D38)(this, str, maxChars);
	}

	bool WriteSignedInt(int u, int bits)
	{
		return ((bool(*)(datBitBuffer*, int, int))0x829EA180)(this, u, bits);
	}

	int GetNumBytesRead()
	{
		return (m_NumBitsRead + 7) >> 3;
	}

	int GetNumBytesWritten()
	{
		return (m_NumBitsWritten + 7) >> 3;
	}
};

class CMessageBuffer
{
public:
	datBitBuffer m_buffer;

	void Setup(uint8_t* buffer, int bytes, int offset, bool unpack) 
	{
		m_buffer.m_ReadBits = buffer;
		m_buffer.m_BaseBitOffset = offset;
		m_buffer.m_MaxBits = bytes << 3;
		m_buffer.m_CursorPos = 0;
		m_buffer.m_NumBitsWritten = 0;
		m_buffer.m_NumBitsRead = 0;
		m_buffer.m_IsReadOnly = unpack;
	}

	virtual ~CMessageBuffer() 
	{
		if(m_buffer.m_ReadBits)
			delete m_buffer.m_ReadBits;
	}

	int GetPos()
	{
		return m_buffer.m_CursorPos + m_buffer.m_BaseBitOffset;
	}

	int GetSize()
	{
		return m_buffer.m_MaxBits >> 3;
	}

	uint16_t PeekShort(int srcBitOffset)
	{
		return static_cast<uint16_t>(m_buffer.PeekUnsigned<uint32_t>(12, srcBitOffset));
	}

	bool PeekBool(int srcBitOffset)
	{
		return m_buffer.PeekUnsigned<uint32_t>(1, srcBitOffset) == 1;
	}

	uint32_t PeekInt(int bits, int srcBitOffset)
	{
		return m_buffer.PeekUnsigned<uint32_t>(bits, srcBitOffset);
	}

	void PokeInt(uint32_t u, int bits, int srcBitOffset)
	{
		m_buffer.PokeUnsigned<uint32_t>(u, bits, srcBitOffset);
	}

	int PeekSignedInt(int bits, int srcBitOffset)
	{
		int sign = static_cast<int>(m_buffer.PeekUnsigned<uint32_t>(1, srcBitOffset));
		uint32_t value = m_buffer.PeekUnsigned<uint32_t>(bits - 1, srcBitOffset + 1);
		return (-sign ^ value) + sign;
	}
};

class CNetworkPeer;
class CNetworkObject //0x98
{
public:
	enum eGlobalNetObjFlag
	{
		NETOBJGLOBALFLAG_PERSISTENTOWNER = 1,
		NETOBJGLOBALFLAG_CLONEALWAYS = 2,
		NETOBJGLOBALFLAG_DONTCLONEFORENEMIES = 4,
		NETOBJGLOBALFLAG_SCRIPTOBJECT = 8
	};

	CEntity* m_BaseEntity;
	eNetworkObjectType m_Type; //8
	uint16_t m_NetID; //0x0C
	bool m_IsClone;
	uint8_t m_PlayerIndex; //0x0F
	uint8_t m_PendingPlayerIndex; //0x10
	uint8_t m_local_flag; //0x11
	uint8_t m_global_flag; //0x12
	char _0x13[0x8D];
	int m_ownershipToken;

	virtual void Delete();
	virtual CEntity* GetEntity();
	virtual void call_08();
	virtual void call_0C();
	virtual void call_10();
	virtual BOOL GetIsTypePed();
	virtual void call_18();
	virtual void call_1C();
	virtual BOOL GetIsTypeVehicle();
	virtual void call_24();
	virtual void call_28();
	virtual void call_2C();
	virtual void call_30();
	virtual CHeli* GetBaseHeli();

	CNetworkPeer* GetPeerOwner()
	{
		return ((CNetworkPeer*(*)(CNetworkObject*))0x82701F68)(this);
	}

	uint16_t GetNetworkID()
	{
		return m_NetID;
	}

	bool IsGlobalFlagSet(int flag)
	{
		return (m_global_flag & flag) != 0;
	}

	eNetworkObjectType GetObjectType()
	{
		return m_Type;
	}
};

class CPlayerInfo
{
public:
	XNADDR m_peerAddress; //0x00
	int _0x24;
	uint64_t m_RlPeerID; //0x28
	uint64_t m_GamerID; //0x30
	char _0x38[8];
	uint64_t m_GamerHandle; //0x40
	int m_LocalIndex; //0x48
	char m_Gamertag[16]; //0x4C
	char _0x5C[0x472];
	uint8_t m_PeerID; //0x4CE
	char _0x4CF;
	int m_State; //0x4D0
	char _0x4D4[0x8C];
	CNetworkPeer* m_NetPlayer; //0x560
	char _0x564[0x14];
	CPlayerPed* m_PlayerPed; //0x578

	const char* GetPlayerName()
	{
		if (this != nullptr && m_Gamertag[0])
			return m_Gamertag;

		return "Invalid";
	}

	CPlayerPed* GetPlayerPed()
	{
		if(this != nullptr)
			return m_PlayerPed;

		return nullptr;
	}
};

#define INVALID_PLAYER_INDEX 0xFF
class CNetworkPeer
{
public:
	int _0x00;
	int _0x04;
	int _0x08;
	int m_CxnId;
	uint8_t m_PeerId;
	char _padding[3];
	int _0x14;
	uint64_t m_SessionId;
	int _0x20;
	XONLINE_NAT_TYPE m_NatType;
	int _0x28;
	int _0x2C;
	char _padding1[8];
	int _0x38;
	uint32_t m_Flags;

	int GetPeerID()
	{
		return static_cast<int>(m_PeerId);
	}

	bool IsValid()
	{
		if (this == nullptr)
			return false;

		return m_PeerId != INVALID_PLAYER_INDEX;
	}

	CPlayerInfo* GetGamerInfo()
	{
		return ((CPlayerInfo*(*)(CNetworkPeer*))0x827087D8)(this);
	}
};

class CNetworkObjectMgr
{
public:
	char _0x00[0x18DC0];
	uint8_t m_ScriptCreationSeq; //0x18DC0

	//inlcudeAll - Checks for unregistering objects as well as being reassigned
	CNetworkObject* GetNetworkObject(short objectID, bool includeAll = false)
	{
		return ((CNetworkObject*(*)(CNetworkObjectMgr*, short, bool))0x826ED600)(this, objectID, includeAll);
	}

	static const char* GetObjectTypeName(eNetworkObjectType type, bool isMissionObject)
	{
		return ((const char*(*)(eNetworkObjectType, bool))0x82702468)(type, isMissionObject);
	}

	void ProcessCloneCreateData(uint8_t peer, eNetworkObjectType objectType, short objectID, uint8_t objectFlags, CMessageBuffer* message)
	{
		((void(*)(CNetworkObjectMgr*, uint8_t, eNetworkObjectType, short, uint8_t, CMessageBuffer*))0x826F1670)(this, peer, objectType, objectID, objectFlags, message);
	}
};
extern CNetworkObjectMgr& ms_objectMgr;

enum NetGameEventTypes : int
{
	REQUEST_CONTROL_EVENT, //Reply, ExtraData
	GIVE_CONTROL_EVENT, //Reply, ExtraData
	OBJECT_ID_FREED_EVENT,
